garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1779.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DAC7REF" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DAC7REF" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-01073_5bit_DAC_wNSS_v2_F177x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x59F">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DAC7CON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="R0" edc:desc="" edc:mask="0x1" edc:name="R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R1" edc:desc="" edc:mask="0x1" edc:name="R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R2" edc:desc="" edc:mask="0x1" edc:name="R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R3" edc:desc="" edc:mask="0x1" edc:name="R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R4" edc:desc="" edc:mask="0x1" edc:name="R4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DAC7R" edc:desc="" edc:mask="0x1f" edc:name="DAC7R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC7R0" edc:desc="" edc:mask="0x1" edc:name="DAC7R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7R1" edc:desc="" edc:mask="0x1" edc:name="DAC7R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7R2" edc:desc="" edc:mask="0x1" edc:name="DAC7R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7R3" edc:desc="" edc:mask="0x1" edc:name="DAC7R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7R4" edc:desc="" edc:mask="0x1" edc:name="DAC7R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:SFRFieldDef edc:cname="REF0" edc:desc="" edc:mask="0x1" edc:name="REF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF1" edc:desc="" edc:mask="0x1" edc:name="REF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF2" edc:desc="" edc:mask="0x1" edc:name="REF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF3" edc:desc="" edc:mask="0x1" edc:name="REF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF4" edc:desc="" edc:mask="0x1" edc:name="REF4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:SFRFieldDef edc:cname="DAC7REF0" edc:desc="" edc:mask="0x1" edc:name="DAC7REF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7REF1" edc:desc="" edc:mask="0x1" edc:name="DAC7REF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7REF2" edc:desc="" edc:mask="0x1" edc:name="DAC7REF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7REF3" edc:desc="" edc:mask="0x1" edc:name="DAC7REF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7REF4" edc:desc="" edc:mask="0x1" edc:name="DAC7REF4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="12" edc:beginaddr="0x600" edc:endaddr="0x620" edc:regionid="sfr12">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x600"/>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="DAC8CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="DAC8CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-01073_5bit_DAC_wNSS_v2_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x60C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x3" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE2" edc:desc="" edc:mask="0x1" edc:name="OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:desc="" edc:mask="0x1" edc:name="OE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NSS0" edc:desc="" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NSS1" edc:desc="" edc:mask="0x1" edc:name="NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:desc="" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:desc="" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="" edc:mask="0x3" edc:name="DACNSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACOE2" edc:desc="" edc:mask="0x1" edc:name="DACOE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DACNSS0" edc:desc="" edc:mask="0x1" edc:name="DACNSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACNSS1" edc:desc="" edc:mask="0x1" edc:name="DACNSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC8NSS" edc:desc="" edc:mask="0x3" edc:name="DAC8NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC8PSS" edc:desc="" edc:mask="0x3" edc:name="DAC8PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC8OE2" edc:desc="" edc:mask="0x1" edc:name="DAC8OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8OE1" edc:desc="" edc:mask="0x1" edc:name="DAC8OE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC8EN" edc:desc="" edc:mask="0x1" edc:name="DAC8EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:SFRFieldDef edc:cname="DAC8NSS0" edc:desc="" edc:mask="0x1" edc:name="DAC8NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8NSS1" edc:desc="" edc:mask="0x1" edc:name="DAC8NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8PSS0" edc:desc="" edc:mask="0x1" edc:name="DAC8PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8PSS1" edc:desc="" edc:mask="0x1" edc:name="DAC8PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DAC8REF" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DAC8REF" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-01073_5bit_DAC_wNSS_v2_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x60D">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DAC8CON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="R0" edc:desc="" edc:mask="0x1" edc:name="R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R1" edc:desc="" edc:mask="0x1" edc:name="R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R2" edc:desc="" edc:mask="0x1" edc:name="R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R3" edc:desc="" edc:mask="0x1" edc:name="R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R4" edc:desc="" edc:mask="0x1" edc:name="R4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DAC8R" edc:desc="" edc:mask="0x1f" edc:name="DAC8R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC8R0" edc:desc="" edc:mask="0x1" edc:name="DAC8R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8R1" edc:desc="" edc:mask="0x1" edc:name="DAC8R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8R2" edc:desc="" edc:mask="0x1" edc:name="DAC8R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8R3" edc:desc="" edc:mask="0x1" edc:name="DAC8R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8R4" edc:desc="" edc:mask="0x1" edc:name="DAC8R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:SFRFieldDef edc:cname="REF0" edc:desc="" edc:mask="0x1" edc:name="REF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF1" edc:desc="" edc:mask="0x1" edc:name="REF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF2" edc:desc="" edc:mask="0x1" edc:name="REF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF3" edc:desc="" edc:mask="0x1" edc:name="REF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF4" edc:desc="" edc:mask="0x1" edc:name="REF4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:SFRFieldDef edc:cname="DAC8REF0" edc:desc="" edc:mask="0x1" edc:name="DAC8REF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8REF1" edc:desc="" edc:mask="0x1" edc:name="DAC8REF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8REF2" edc:desc="" edc:mask="0x1" edc:name="DAC8REF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8REF3" edc:desc="" edc:mask="0x1" edc:name="DAC8REF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC8REF4" edc:desc="" edc:mask="0x1" edc:name="DAC8REF4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG4RTSS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG4RTSS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x60E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTSS" edc:desc="" edc:mask="0xf" edc:name="RTSS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="RTSS0" edc:desc="" edc:mask="0x1" edc:name="RTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS1" edc:desc="" edc:mask="0x1" edc:name="RTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS2" edc:desc="" edc:mask="0x1" edc:name="RTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS3" edc:desc="" edc:mask="0x1" edc:name="RTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG4RTSS0" edc:desc="" edc:mask="0x1" edc:name="RG4RTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4RTSS1" edc:desc="" edc:mask="0x1" edc:name="RG4RTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4RTSS2" edc:desc="" edc:mask="0x1" edc:name="RG4RTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4RTSS3" edc:desc="" edc:mask="0x1" edc:name="RG4RTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG4FTSS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG4FTSS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x60F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FTSS" edc:desc="" edc:mask="0xf" edc:name="FTSS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="FTSS0" edc:desc="" edc:mask="0x1" edc:name="FTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS1" edc:desc="" edc:mask="0x1" edc:name="FTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS2" edc:desc="" edc:mask="0x1" edc:name="FTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS3" edc:desc="" edc:mask="0x1" edc:name="FTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG4FTSS0" edc:desc="" edc:mask="0x1" edc:name="RG4FTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4FTSS1" edc:desc="" edc:mask="0x1" edc:name="RG4FTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4FTSS2" edc:desc="" edc:mask="0x1" edc:name="RG4FTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4FTSS3" edc:desc="" edc:mask="0x1" edc:name="RG4FTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
