garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1779.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x811">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3DBR0" edc:desc="" edc:mask="0x1" edc:name="G3DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBR1" edc:desc="" edc:mask="0x1" edc:name="G3DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBR2" edc:desc="" edc:mask="0x1" edc:name="G3DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBR3" edc:desc="" edc:mask="0x1" edc:name="G3DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBR4" edc:desc="" edc:mask="0x1" edc:name="G3DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBR5" edc:desc="" edc:mask="0x1" edc:name="G3DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x812">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G3DBF0" edc:desc="" edc:mask="0x1" edc:name="G3DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBF1" edc:desc="" edc:mask="0x1" edc:name="G3DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBF2" edc:desc="" edc:mask="0x1" edc:name="G3DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBF3" edc:desc="" edc:mask="0x1" edc:name="G3DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBF4" edc:desc="" edc:mask="0x1" edc:name="G3DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBF5" edc:desc="" edc:mask="0x1" edc:name="G3DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3DBF" edc:desc="" edc:mask="0x3f" edc:name="G3DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="COG3CON0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="COG3CON0" edc:nzwidth="0x8" edc:por="00-00000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x813">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MD" edc:desc="" edc:mask="0x7" edc:name="MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MD0" edc:desc="" edc:mask="0x1" edc:name="MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1" edc:desc="" edc:mask="0x1" edc:name="MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2" edc:desc="" edc:mask="0x1" edc:name="MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3MD" edc:desc="" edc:mask="0x7" edc:name="G3MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="G3CS" edc:desc="" edc:mask="0x3" edc:name="G3CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G3LD" edc:desc="" edc:mask="0x1" edc:name="G3LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3EN" edc:desc="" edc:mask="0x1" edc:name="G3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="G3MD0" edc:desc="" edc:mask="0x1" edc:name="G3MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3MD1" edc:desc="" edc:mask="0x1" edc:name="G3MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3MD2" edc:desc="" edc:mask="0x1" edc:name="G3MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3CS0" edc:desc="" edc:mask="0x1" edc:name="G3CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3CS1" edc:desc="" edc:mask="0x1" edc:name="G3CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="COG3CON1" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="COG3CON1" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x814">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POLA" edc:desc="" edc:mask="0x1" edc:name="POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLB" edc:desc="" edc:mask="0x1" edc:name="POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLC" edc:desc="" edc:mask="0x1" edc:name="POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLD" edc:desc="" edc:mask="0x1" edc:name="POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FDBS" edc:desc="" edc:mask="0x1" edc:name="FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDBS" edc:desc="" edc:mask="0x1" edc:name="RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3POLA" edc:desc="" edc:mask="0x1" edc:name="G3POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POLB" edc:desc="" edc:mask="0x1" edc:name="G3POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POLC" edc:desc="" edc:mask="0x1" edc:name="G3POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POLD" edc:desc="" edc:mask="0x1" edc:name="G3POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G3FDBS" edc:desc="" edc:mask="0x1" edc:name="G3FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RDBS" edc:desc="" edc:mask="0x1" edc:name="G3RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG3RIS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG3RIS0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x815">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS0" edc:desc="" edc:mask="0x1" edc:name="RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS1" edc:desc="" edc:mask="0x1" edc:name="RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS2" edc:desc="" edc:mask="0x1" edc:name="RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS3" edc:desc="" edc:mask="0x1" edc:name="RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS4" edc:desc="" edc:mask="0x1" edc:name="RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS5" edc:desc="" edc:mask="0x1" edc:name="RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS6" edc:desc="" edc:mask="0x1" edc:name="RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS7" edc:desc="" edc:mask="0x1" edc:name="RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3RIS0" edc:desc="" edc:mask="0x1" edc:name="G3RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS1" edc:desc="" edc:mask="0x1" edc:name="G3RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS2" edc:desc="" edc:mask="0x1" edc:name="G3RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS3" edc:desc="" edc:mask="0x1" edc:name="G3RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS4" edc:desc="" edc:mask="0x1" edc:name="G3RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS5" edc:desc="" edc:mask="0x1" edc:name="G3RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS6" edc:desc="" edc:mask="0x1" edc:name="G3RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS7" edc:desc="" edc:mask="0x1" edc:name="G3RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
