garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1779.PIC
        <edc:SFRDef edc:access="nnnnn-n-" edc:cname="COG3RIS1" edc:desc="" edc:impl="0xfa" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-0-" edc:name="COG3RIS1" edc:nzwidth="8" edc:por="00000-0-" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x816">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RIS9" edc:desc="" edc:mask="0x1" edc:name="RIS9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RIS11" edc:desc="" edc:mask="0x1" edc:name="RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS12" edc:desc="" edc:mask="0x1" edc:name="RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS13" edc:desc="" edc:mask="0x1" edc:name="RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS14" edc:desc="" edc:mask="0x1" edc:name="RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS15" edc:desc="" edc:mask="0x1" edc:name="RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS9" edc:desc="" edc:mask="0x1" edc:name="G3RIS9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS11" edc:desc="" edc:mask="0x1" edc:name="G3RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS12" edc:desc="" edc:mask="0x1" edc:name="G3RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS13" edc:desc="" edc:mask="0x1" edc:name="G3RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS14" edc:desc="" edc:mask="0x1" edc:name="G3RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RIS15" edc:desc="" edc:mask="0x1" edc:name="G3RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG3RSIM0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG3RSIM0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x817">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM0" edc:desc="" edc:mask="0x1" edc:name="RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM1" edc:desc="" edc:mask="0x1" edc:name="RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM2" edc:desc="" edc:mask="0x1" edc:name="RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM3" edc:desc="" edc:mask="0x1" edc:name="RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM4" edc:desc="" edc:mask="0x1" edc:name="RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM5" edc:desc="" edc:mask="0x1" edc:name="RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM6" edc:desc="" edc:mask="0x1" edc:name="RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM7" edc:desc="" edc:mask="0x1" edc:name="RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3RSIM0" edc:desc="" edc:mask="0x1" edc:name="G3RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM1" edc:desc="" edc:mask="0x1" edc:name="G3RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM2" edc:desc="" edc:mask="0x1" edc:name="G3RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM3" edc:desc="" edc:mask="0x1" edc:name="G3RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM4" edc:desc="" edc:mask="0x1" edc:name="G3RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM5" edc:desc="" edc:mask="0x1" edc:name="G3RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM6" edc:desc="" edc:mask="0x1" edc:name="G3RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM7" edc:desc="" edc:mask="0x1" edc:name="G3RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-n-" edc:cname="COG3RSIM1" edc:desc="" edc:impl="0xfa" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-0-" edc:name="COG3RSIM1" edc:nzwidth="8" edc:por="00000-0-" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x818">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RSIM9" edc:desc="" edc:mask="0x1" edc:name="RSIM9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RSIM11" edc:desc="" edc:mask="0x1" edc:name="RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM12" edc:desc="" edc:mask="0x1" edc:name="RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM13" edc:desc="" edc:mask="0x1" edc:name="RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM14" edc:desc="" edc:mask="0x1" edc:name="RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM15" edc:desc="" edc:mask="0x1" edc:name="RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM9" edc:desc="" edc:mask="0x1" edc:name="G3RSIM9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM11" edc:desc="" edc:mask="0x1" edc:name="G3RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM12" edc:desc="" edc:mask="0x1" edc:name="G3RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM13" edc:desc="" edc:mask="0x1" edc:name="G3RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM14" edc:desc="" edc:mask="0x1" edc:name="G3RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3RSIM15" edc:desc="" edc:mask="0x1" edc:name="G3RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
