garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1779.PIC
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="COG4CON1" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="COG4CON1" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x894">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POLA" edc:desc="" edc:mask="0x1" edc:name="POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLB" edc:desc="" edc:mask="0x1" edc:name="POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLC" edc:desc="" edc:mask="0x1" edc:name="POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLD" edc:desc="" edc:mask="0x1" edc:name="POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FDBS" edc:desc="" edc:mask="0x1" edc:name="FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDBS" edc:desc="" edc:mask="0x1" edc:name="RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4POLA" edc:desc="" edc:mask="0x1" edc:name="G4POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POLB" edc:desc="" edc:mask="0x1" edc:name="G4POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POLC" edc:desc="" edc:mask="0x1" edc:name="G4POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POLD" edc:desc="" edc:mask="0x1" edc:name="G4POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G4FDBS" edc:desc="" edc:mask="0x1" edc:name="G4FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RDBS" edc:desc="" edc:mask="0x1" edc:name="G4RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG4RIS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG4RIS0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x895">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS0" edc:desc="" edc:mask="0x1" edc:name="RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS1" edc:desc="" edc:mask="0x1" edc:name="RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS2" edc:desc="" edc:mask="0x1" edc:name="RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS3" edc:desc="" edc:mask="0x1" edc:name="RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS4" edc:desc="" edc:mask="0x1" edc:name="RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS5" edc:desc="" edc:mask="0x1" edc:name="RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS6" edc:desc="" edc:mask="0x1" edc:name="RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS7" edc:desc="" edc:mask="0x1" edc:name="RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4RIS0" edc:desc="" edc:mask="0x1" edc:name="G4RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS1" edc:desc="" edc:mask="0x1" edc:name="G4RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS2" edc:desc="" edc:mask="0x1" edc:name="G4RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS3" edc:desc="" edc:mask="0x1" edc:name="G4RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS4" edc:desc="" edc:mask="0x1" edc:name="G4RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS5" edc:desc="" edc:mask="0x1" edc:name="G4RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS6" edc:desc="" edc:mask="0x1" edc:name="G4RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS7" edc:desc="" edc:mask="0x1" edc:name="G4RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG4RIS1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG4RIS1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x896">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS8" edc:desc="" edc:mask="0x1" edc:name="RIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS9" edc:desc="" edc:mask="0x1" edc:name="RIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS10" edc:desc="" edc:mask="0x1" edc:name="RIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS11" edc:desc="" edc:mask="0x1" edc:name="RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS12" edc:desc="" edc:mask="0x1" edc:name="RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS13" edc:desc="" edc:mask="0x1" edc:name="RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS14" edc:desc="" edc:mask="0x1" edc:name="RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS15" edc:desc="" edc:mask="0x1" edc:name="RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4RIS8" edc:desc="" edc:mask="0x1" edc:name="G4RIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS9" edc:desc="" edc:mask="0x1" edc:name="G4RIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS10" edc:desc="" edc:mask="0x1" edc:name="G4RIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS11" edc:desc="" edc:mask="0x1" edc:name="G4RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS12" edc:desc="" edc:mask="0x1" edc:name="G4RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS13" edc:desc="" edc:mask="0x1" edc:name="G4RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS14" edc:desc="" edc:mask="0x1" edc:name="G4RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RIS15" edc:desc="" edc:mask="0x1" edc:name="G4RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG4RSIM0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG4RSIM0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x897">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM0" edc:desc="" edc:mask="0x1" edc:name="RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM1" edc:desc="" edc:mask="0x1" edc:name="RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM2" edc:desc="" edc:mask="0x1" edc:name="RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM3" edc:desc="" edc:mask="0x1" edc:name="RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM4" edc:desc="" edc:mask="0x1" edc:name="RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM5" edc:desc="" edc:mask="0x1" edc:name="RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM6" edc:desc="" edc:mask="0x1" edc:name="RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM7" edc:desc="" edc:mask="0x1" edc:name="RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4RSIM0" edc:desc="" edc:mask="0x1" edc:name="G4RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM1" edc:desc="" edc:mask="0x1" edc:name="G4RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM2" edc:desc="" edc:mask="0x1" edc:name="G4RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM3" edc:desc="" edc:mask="0x1" edc:name="G4RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM4" edc:desc="" edc:mask="0x1" edc:name="G4RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM5" edc:desc="" edc:mask="0x1" edc:name="G4RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM6" edc:desc="" edc:mask="0x1" edc:name="G4RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM7" edc:desc="" edc:mask="0x1" edc:name="G4RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG4RSIM1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG4RSIM1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x898">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM8" edc:desc="" edc:mask="0x1" edc:name="RSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM9" edc:desc="" edc:mask="0x1" edc:name="RSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM10" edc:desc="" edc:mask="0x1" edc:name="RSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM11" edc:desc="" edc:mask="0x1" edc:name="RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM12" edc:desc="" edc:mask="0x1" edc:name="RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM13" edc:desc="" edc:mask="0x1" edc:name="RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM14" edc:desc="" edc:mask="0x1" edc:name="RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM15" edc:desc="" edc:mask="0x1" edc:name="RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4RSIM8" edc:desc="" edc:mask="0x1" edc:name="G4RSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM9" edc:desc="" edc:mask="0x1" edc:name="G4RSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM10" edc:desc="" edc:mask="0x1" edc:name="G4RSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM11" edc:desc="" edc:mask="0x1" edc:name="G4RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM12" edc:desc="" edc:mask="0x1" edc:name="G4RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM13" edc:desc="" edc:mask="0x1" edc:name="G4RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM14" edc:desc="" edc:mask="0x1" edc:name="G4RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4RSIM15" edc:desc="" edc:mask="0x1" edc:name="G4RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG4FIS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG4FIS0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x899">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIS0" edc:desc="" edc:mask="0x1" edc:name="FIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS1" edc:desc="" edc:mask="0x1" edc:name="FIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS2" edc:desc="" edc:mask="0x1" edc:name="FIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS3" edc:desc="" edc:mask="0x1" edc:name="FIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS4" edc:desc="" edc:mask="0x1" edc:name="FIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS5" edc:desc="" edc:mask="0x1" edc:name="FIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS6" edc:desc="" edc:mask="0x1" edc:name="FIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS7" edc:desc="" edc:mask="0x1" edc:name="FIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4FIS0" edc:desc="" edc:mask="0x1" edc:name="G4FIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS1" edc:desc="" edc:mask="0x1" edc:name="G4FIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS2" edc:desc="" edc:mask="0x1" edc:name="G4FIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS3" edc:desc="" edc:mask="0x1" edc:name="G4FIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS4" edc:desc="" edc:mask="0x1" edc:name="G4FIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS5" edc:desc="" edc:mask="0x1" edc:name="G4FIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS6" edc:desc="" edc:mask="0x1" edc:name="G4FIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS7" edc:desc="" edc:mask="0x1" edc:name="G4FIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG4FIS1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG4FIS1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x89A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIS8" edc:desc="" edc:mask="0x1" edc:name="FIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS9" edc:desc="" edc:mask="0x1" edc:name="FIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS10" edc:desc="" edc:mask="0x1" edc:name="FIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS11" edc:desc="" edc:mask="0x1" edc:name="FIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS12" edc:desc="" edc:mask="0x1" edc:name="FIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS13" edc:desc="" edc:mask="0x1" edc:name="FIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS14" edc:desc="" edc:mask="0x1" edc:name="FIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS15" edc:desc="" edc:mask="0x1" edc:name="FIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4FIS8" edc:desc="" edc:mask="0x1" edc:name="G4FIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS9" edc:desc="" edc:mask="0x1" edc:name="G4FIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS10" edc:desc="" edc:mask="0x1" edc:name="G4FIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS11" edc:desc="" edc:mask="0x1" edc:name="G4FIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS12" edc:desc="" edc:mask="0x1" edc:name="G4FIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS13" edc:desc="" edc:mask="0x1" edc:name="G4FIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS14" edc:desc="" edc:mask="0x1" edc:name="G4FIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FIS15" edc:desc="" edc:mask="0x1" edc:name="G4FIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG4FSIM0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG4FSIM0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x89B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSIM0" edc:desc="" edc:mask="0x1" edc:name="FSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM1" edc:desc="" edc:mask="0x1" edc:name="FSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM2" edc:desc="" edc:mask="0x1" edc:name="FSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM3" edc:desc="" edc:mask="0x1" edc:name="FSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM4" edc:desc="" edc:mask="0x1" edc:name="FSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM5" edc:desc="" edc:mask="0x1" edc:name="FSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM6" edc:desc="" edc:mask="0x1" edc:name="FSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM7" edc:desc="" edc:mask="0x1" edc:name="FSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4FSIM0" edc:desc="" edc:mask="0x1" edc:name="G4FSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM1" edc:desc="" edc:mask="0x1" edc:name="G4FSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM2" edc:desc="" edc:mask="0x1" edc:name="G4FSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM3" edc:desc="" edc:mask="0x1" edc:name="G4FSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM4" edc:desc="" edc:mask="0x1" edc:name="G4FSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM5" edc:desc="" edc:mask="0x1" edc:name="G4FSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM6" edc:desc="" edc:mask="0x1" edc:name="G4FSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM7" edc:desc="" edc:mask="0x1" edc:name="G4FSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG4FSIM1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG4FSIM1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x89C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSIM8" edc:desc="" edc:mask="0x1" edc:name="FSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM9" edc:desc="" edc:mask="0x1" edc:name="FSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM10" edc:desc="" edc:mask="0x1" edc:name="FSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM11" edc:desc="" edc:mask="0x1" edc:name="FSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM12" edc:desc="" edc:mask="0x1" edc:name="FSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM13" edc:desc="" edc:mask="0x1" edc:name="FSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM14" edc:desc="" edc:mask="0x1" edc:name="FSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM15" edc:desc="" edc:mask="0x1" edc:name="FSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4FSIM8" edc:desc="" edc:mask="0x1" edc:name="G4FSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM9" edc:desc="" edc:mask="0x1" edc:name="G4FSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM10" edc:desc="" edc:mask="0x1" edc:name="G4FSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM11" edc:desc="" edc:mask="0x1" edc:name="G4FSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM12" edc:desc="" edc:mask="0x1" edc:name="G4FSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM13" edc:desc="" edc:mask="0x1" edc:name="G4FSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM14" edc:desc="" edc:mask="0x1" edc:name="G4FSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4FSIM15" edc:desc="" edc:mask="0x1" edc:name="G4FSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="COG4ASD0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0x0101--" edc:name="COG4ASD0" edc:nzwidth="8" edc:por="000101--" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x89D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ASDAC" edc:desc="" edc:mask="0x3" edc:name="ASDAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ASDBD" edc:desc="" edc:mask="0x3" edc:name="ASDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ASREN" edc:desc="" edc:mask="0x1" edc:name="ASREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASE" edc:desc="" edc:mask="0x1" edc:name="ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ASDAC0" edc:desc="" edc:mask="0x1" edc:name="ASDAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASDAC1" edc:desc="" edc:mask="0x1" edc:name="ASDAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASDBD0" edc:desc="" edc:mask="0x1" edc:name="ASDBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASDBD1" edc:desc="" edc:mask="0x1" edc:name="ASDBD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ARSEN" edc:desc="" edc:mask="0x1" edc:name="ARSEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G4ASDAC" edc:desc="" edc:mask="0x3" edc:name="G4ASDAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G4ASDBD" edc:desc="" edc:mask="0x3" edc:name="G4ASDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G4ARSEN" edc:desc="" edc:mask="0x1" edc:name="G4ARSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4ASE" edc:desc="" edc:mask="0x1" edc:name="G4ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G4ASDAC0" edc:desc="" edc:mask="0x1" edc:name="G4ASDAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4ASDAC1" edc:desc="" edc:mask="0x1" edc:name="G4ASDAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4ASDBD0" edc:desc="" edc:mask="0x1" edc:name="G4ASDBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4ASDBD1" edc:desc="" edc:mask="0x1" edc:name="G4ASDBD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4ASREN" edc:desc="" edc:mask="0x1" edc:name="G4ASREN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
