garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1779.PIC
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM6CLKCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM6CLKCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x7" edc:name="PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM6CS0" edc:desc="" edc:mask="0x1" edc:name="PWM6CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6CS1" edc:desc="" edc:mask="0x1" edc:name="PWM6CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6CS2" edc:desc="" edc:mask="0x1" edc:name="PWM6CS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM6PS0" edc:desc="" edc:mask="0x1" edc:name="PWM6PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6PS1" edc:desc="" edc:mask="0x1" edc:name="PWM6PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6PS2" edc:desc="" edc:mask="0x1" edc:name="PWM6PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM6CS" edc:desc="" edc:mask="0x7" edc:name="PWM6CS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM6PS" edc:desc="" edc:mask="0x7" edc:name="PWM6PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:desc="" edc:mask="0x1" edc:name="CS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="PWM6LDCON" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="PWM6LDCON" edc:nzwidth="8" edc:por="00----00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDS" edc:desc="" edc:mask="0x3" edc:name="LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LDT" edc:desc="" edc:mask="0x1" edc:name="LDT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LDA" edc:desc="" edc:mask="0x1" edc:name="LDA" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM6LDS0" edc:desc="" edc:mask="0x1" edc:name="PWM6LDS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6LDS1" edc:desc="" edc:mask="0x1" edc:name="PWM6LDS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM6LDS" edc:desc="" edc:mask="0x3" edc:name="PWM6LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM6LDM" edc:desc="" edc:mask="0x1" edc:name="PWM6LDM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6LD" edc:desc="" edc:mask="0x1" edc:name="PWM6LD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LDS0" edc:desc="" edc:mask="0x1" edc:name="LDS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LDS1" edc:desc="" edc:mask="0x1" edc:name="LDS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM6OFCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM6OFCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFS" edc:desc="" edc:mask="0x3" edc:name="OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OFO" edc:desc="" edc:mask="0x1" edc:name="OFO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM" edc:desc="" edc:mask="0x3" edc:name="OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM6OFS0" edc:desc="" edc:mask="0x1" edc:name="PWM6OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6OFS1" edc:desc="" edc:mask="0x1" edc:name="PWM6OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM6OFM0" edc:desc="" edc:mask="0x1" edc:name="PWM6OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6OFM1" edc:desc="" edc:mask="0x1" edc:name="PWM6OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM6OFS" edc:desc="" edc:mask="0x3" edc:name="PWM6OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM6OFMC" edc:desc="" edc:mask="0x1" edc:name="PWM6OFMC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6OFM" edc:desc="" edc:mask="0x3" edc:name="PWM6OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OFS0" edc:desc="" edc:mask="0x1" edc:name="OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFS1" edc:desc="" edc:mask="0x1" edc:name="OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OFM0" edc:desc="" edc:mask="0x1" edc:name="OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM1" edc:desc="" edc:mask="0x1" edc:name="OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM11PH" edc:desc="" edc:name="PWM11PH" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB1">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM11PHL" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM11PHL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB1">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM11PHL0" edc:desc="" edc:mask="0x1" edc:name="PWM11PHL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHL1" edc:desc="" edc:mask="0x1" edc:name="PWM11PHL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHL2" edc:desc="" edc:mask="0x1" edc:name="PWM11PHL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHL3" edc:desc="" edc:mask="0x1" edc:name="PWM11PHL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHL4" edc:desc="" edc:mask="0x1" edc:name="PWM11PHL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHL5" edc:desc="" edc:mask="0x1" edc:name="PWM11PHL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHL6" edc:desc="" edc:mask="0x1" edc:name="PWM11PHL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHL7" edc:desc="" edc:mask="0x1" edc:name="PWM11PHL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM11PHL" edc:desc="" edc:mask="0xff" edc:name="PWM11PHL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM11PHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM11PHH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB2">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM11PHH0" edc:desc="" edc:mask="0x1" edc:name="PWM11PHH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHH1" edc:desc="" edc:mask="0x1" edc:name="PWM11PHH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHH2" edc:desc="" edc:mask="0x1" edc:name="PWM11PHH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHH3" edc:desc="" edc:mask="0x1" edc:name="PWM11PHH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHH4" edc:desc="" edc:mask="0x1" edc:name="PWM11PHH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHH5" edc:desc="" edc:mask="0x1" edc:name="PWM11PHH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHH6" edc:desc="" edc:mask="0x1" edc:name="PWM11PHH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PHH7" edc:desc="" edc:mask="0x1" edc:name="PWM11PHH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM11PHH" edc:desc="" edc:mask="0xff" edc:name="PWM11PHH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM11DC" edc:desc="" edc:name="PWM11DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB3">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM11DCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM11DCL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB3">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM11DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM11DCL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM11DCL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCL2" edc:desc="" edc:mask="0x1" edc:name="PWM11DCL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCL3" edc:desc="" edc:mask="0x1" edc:name="PWM11DCL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCL4" edc:desc="" edc:mask="0x1" edc:name="PWM11DCL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCL5" edc:desc="" edc:mask="0x1" edc:name="PWM11DCL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCL6" edc:desc="" edc:mask="0x1" edc:name="PWM11DCL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCL7" edc:desc="" edc:mask="0x1" edc:name="PWM11DCL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM11DCL" edc:desc="" edc:mask="0xff" edc:name="PWM11DCL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM11DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM11DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB4">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM11DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM11DCH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM11DCH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM11DCH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM11DCH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM11DCH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM11DCH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM11DCH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM11DCH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM11DCH" edc:desc="" edc:mask="0xff" edc:name="PWM11DCH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM11PR" edc:desc="" edc:name="PWM11PR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB5">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM11PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM11PRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM11PRL0" edc:desc="" edc:mask="0x1" edc:name="PWM11PRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRL1" edc:desc="" edc:mask="0x1" edc:name="PWM11PRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRL2" edc:desc="" edc:mask="0x1" edc:name="PWM11PRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRL3" edc:desc="" edc:mask="0x1" edc:name="PWM11PRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRL4" edc:desc="" edc:mask="0x1" edc:name="PWM11PRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRL5" edc:desc="" edc:mask="0x1" edc:name="PWM11PRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRL6" edc:desc="" edc:mask="0x1" edc:name="PWM11PRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRL7" edc:desc="" edc:mask="0x1" edc:name="PWM11PRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM11PRL" edc:desc="" edc:mask="0xff" edc:name="PWM11PRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM11PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM11PRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB6">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM11PRH0" edc:desc="" edc:mask="0x1" edc:name="PWM11PRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRH1" edc:desc="" edc:mask="0x1" edc:name="PWM11PRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRH2" edc:desc="" edc:mask="0x1" edc:name="PWM11PRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRH3" edc:desc="" edc:mask="0x1" edc:name="PWM11PRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRH4" edc:desc="" edc:mask="0x1" edc:name="PWM11PRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRH5" edc:desc="" edc:mask="0x1" edc:name="PWM11PRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRH6" edc:desc="" edc:mask="0x1" edc:name="PWM11PRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11PRH7" edc:desc="" edc:mask="0x1" edc:name="PWM11PRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM11PRH" edc:desc="" edc:mask="0xff" edc:name="PWM11PRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM11OF" edc:desc="" edc:name="PWM11OF" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB7">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM11OFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM11OFL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM11OFL0" edc:desc="" edc:mask="0x1" edc:name="PWM11OFL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFL1" edc:desc="" edc:mask="0x1" edc:name="PWM11OFL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFL2" edc:desc="" edc:mask="0x1" edc:name="PWM11OFL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFL3" edc:desc="" edc:mask="0x1" edc:name="PWM11OFL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFL4" edc:desc="" edc:mask="0x1" edc:name="PWM11OFL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFL5" edc:desc="" edc:mask="0x1" edc:name="PWM11OFL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFL6" edc:desc="" edc:mask="0x1" edc:name="PWM11OFL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFL7" edc:desc="" edc:mask="0x1" edc:name="PWM11OFL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM11OFL" edc:desc="" edc:mask="0xff" edc:name="PWM11OFL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM11OFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM11OFH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM11OFH0" edc:desc="" edc:mask="0x1" edc:name="PWM11OFH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFH1" edc:desc="" edc:mask="0x1" edc:name="PWM11OFH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFH2" edc:desc="" edc:mask="0x1" edc:name="PWM11OFH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFH3" edc:desc="" edc:mask="0x1" edc:name="PWM11OFH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFH4" edc:desc="" edc:mask="0x1" edc:name="PWM11OFH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFH5" edc:desc="" edc:mask="0x1" edc:name="PWM11OFH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFH6" edc:desc="" edc:mask="0x1" edc:name="PWM11OFH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11OFH7" edc:desc="" edc:mask="0x1" edc:name="PWM11OFH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM11OFH" edc:desc="" edc:mask="0xff" edc:name="PWM11OFH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
