garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1779.PIC
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM11OFCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM11OFCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFS" edc:desc="" edc:mask="0x3" edc:name="OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OFO" edc:desc="" edc:mask="0x1" edc:name="OFO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM" edc:desc="" edc:mask="0x3" edc:name="OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM11OFS0" edc:desc="" edc:mask="0x1" edc:name="PWM11OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11OFS1" edc:desc="" edc:mask="0x1" edc:name="PWM11OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM11OFM0" edc:desc="" edc:mask="0x1" edc:name="PWM11OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11OFM1" edc:desc="" edc:mask="0x1" edc:name="PWM11OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM11OFS" edc:desc="" edc:mask="0x3" edc:name="PWM11OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM11OFMC" edc:desc="" edc:mask="0x1" edc:name="PWM11OFMC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11OFM" edc:desc="" edc:mask="0x3" edc:name="PWM11OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OFS0" edc:desc="" edc:mask="0x1" edc:name="OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFS1" edc:desc="" edc:mask="0x1" edc:name="OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OFM0" edc:desc="" edc:mask="0x1" edc:name="OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM1" edc:desc="" edc:mask="0x1" edc:name="OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM12PH" edc:desc="" edc:name="PWM12PH" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC1">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM12PHL" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM12PHL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC1">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM12PHL0" edc:desc="" edc:mask="0x1" edc:name="PWM12PHL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHL1" edc:desc="" edc:mask="0x1" edc:name="PWM12PHL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHL2" edc:desc="" edc:mask="0x1" edc:name="PWM12PHL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHL3" edc:desc="" edc:mask="0x1" edc:name="PWM12PHL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHL4" edc:desc="" edc:mask="0x1" edc:name="PWM12PHL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHL5" edc:desc="" edc:mask="0x1" edc:name="PWM12PHL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHL6" edc:desc="" edc:mask="0x1" edc:name="PWM12PHL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHL7" edc:desc="" edc:mask="0x1" edc:name="PWM12PHL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM12PHL" edc:desc="" edc:mask="0xff" edc:name="PWM12PHL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM12PHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM12PHH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC2">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM12PHH0" edc:desc="" edc:mask="0x1" edc:name="PWM12PHH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHH1" edc:desc="" edc:mask="0x1" edc:name="PWM12PHH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHH2" edc:desc="" edc:mask="0x1" edc:name="PWM12PHH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHH3" edc:desc="" edc:mask="0x1" edc:name="PWM12PHH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHH4" edc:desc="" edc:mask="0x1" edc:name="PWM12PHH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHH5" edc:desc="" edc:mask="0x1" edc:name="PWM12PHH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHH6" edc:desc="" edc:mask="0x1" edc:name="PWM12PHH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PHH7" edc:desc="" edc:mask="0x1" edc:name="PWM12PHH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM12PHH" edc:desc="" edc:mask="0xff" edc:name="PWM12PHH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM12DC" edc:desc="" edc:name="PWM12DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC3">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM12DCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM12DCL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC3">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM12DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM12DCL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM12DCL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCL2" edc:desc="" edc:mask="0x1" edc:name="PWM12DCL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCL3" edc:desc="" edc:mask="0x1" edc:name="PWM12DCL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCL4" edc:desc="" edc:mask="0x1" edc:name="PWM12DCL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCL5" edc:desc="" edc:mask="0x1" edc:name="PWM12DCL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCL6" edc:desc="" edc:mask="0x1" edc:name="PWM12DCL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCL7" edc:desc="" edc:mask="0x1" edc:name="PWM12DCL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM12DCL" edc:desc="" edc:mask="0xff" edc:name="PWM12DCL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM12DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM12DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC4">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM12DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM12DCH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM12DCH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM12DCH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM12DCH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM12DCH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM12DCH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM12DCH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM12DCH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM12DCH" edc:desc="" edc:mask="0xff" edc:name="PWM12DCH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM12PR" edc:desc="" edc:name="PWM12PR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC5">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM12PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM12PRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM12PRL0" edc:desc="" edc:mask="0x1" edc:name="PWM12PRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRL1" edc:desc="" edc:mask="0x1" edc:name="PWM12PRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRL2" edc:desc="" edc:mask="0x1" edc:name="PWM12PRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRL3" edc:desc="" edc:mask="0x1" edc:name="PWM12PRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRL4" edc:desc="" edc:mask="0x1" edc:name="PWM12PRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRL5" edc:desc="" edc:mask="0x1" edc:name="PWM12PRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRL6" edc:desc="" edc:mask="0x1" edc:name="PWM12PRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRL7" edc:desc="" edc:mask="0x1" edc:name="PWM12PRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM12PRL" edc:desc="" edc:mask="0xff" edc:name="PWM12PRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM12PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM12PRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC6">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM12PRH0" edc:desc="" edc:mask="0x1" edc:name="PWM12PRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRH1" edc:desc="" edc:mask="0x1" edc:name="PWM12PRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRH2" edc:desc="" edc:mask="0x1" edc:name="PWM12PRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRH3" edc:desc="" edc:mask="0x1" edc:name="PWM12PRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRH4" edc:desc="" edc:mask="0x1" edc:name="PWM12PRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRH5" edc:desc="" edc:mask="0x1" edc:name="PWM12PRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRH6" edc:desc="" edc:mask="0x1" edc:name="PWM12PRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12PRH7" edc:desc="" edc:mask="0x1" edc:name="PWM12PRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM12PRH" edc:desc="" edc:mask="0xff" edc:name="PWM12PRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM12OF" edc:desc="" edc:name="PWM12OF" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC7">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM12OFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM12OFL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM12OFL0" edc:desc="" edc:mask="0x1" edc:name="PWM12OFL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFL1" edc:desc="" edc:mask="0x1" edc:name="PWM12OFL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFL2" edc:desc="" edc:mask="0x1" edc:name="PWM12OFL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFL3" edc:desc="" edc:mask="0x1" edc:name="PWM12OFL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFL4" edc:desc="" edc:mask="0x1" edc:name="PWM12OFL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFL5" edc:desc="" edc:mask="0x1" edc:name="PWM12OFL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFL6" edc:desc="" edc:mask="0x1" edc:name="PWM12OFL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFL7" edc:desc="" edc:mask="0x1" edc:name="PWM12OFL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM12OFL" edc:desc="" edc:mask="0xff" edc:name="PWM12OFL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM12OFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM12OFH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM12OFH0" edc:desc="" edc:mask="0x1" edc:name="PWM12OFH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFH1" edc:desc="" edc:mask="0x1" edc:name="PWM12OFH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFH2" edc:desc="" edc:mask="0x1" edc:name="PWM12OFH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFH3" edc:desc="" edc:mask="0x1" edc:name="PWM12OFH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFH4" edc:desc="" edc:mask="0x1" edc:name="PWM12OFH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFH5" edc:desc="" edc:mask="0x1" edc:name="PWM12OFH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFH6" edc:desc="" edc:mask="0x1" edc:name="PWM12OFH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12OFH7" edc:desc="" edc:mask="0x1" edc:name="PWM12OFH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM12OFH" edc:desc="" edc:mask="0xff" edc:name="PWM12OFH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM12TMR" edc:desc="" edc:name="PWM12TMR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC9">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM12TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM12TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM12TMRL0" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRL1" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRL2" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRL3" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRL4" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRL5" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRL6" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRL7" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM12TMRL" edc:desc="" edc:mask="0xff" edc:name="PWM12TMRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM12TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM12TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDCA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM12TMRH0" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRH1" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRH2" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRH3" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRH4" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRH5" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRH6" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM12TMRH7" edc:desc="" edc:mask="0x1" edc:name="PWM12TMRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM12TMRH" edc:desc="" edc:mask="0xff" edc:name="PWM12TMRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
