garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1779.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RE1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RE1PPS" edc:nzwidth="8" edc:por="--000000" edc:_addr="0xEB1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE1PPS" edc:desc="" edc:mask="0x3f" edc:name="RE1PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RE2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RE2PPS" edc:nzwidth="8" edc:por="--000000" edc:_addr="0xEB2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE2PPS" edc:desc="" edc:mask="0x3f" edc:name="RE2PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xEB3"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="30" edc:beginaddr="0xf00" edc:endaddr="0xf70" edc:regionid="sfr30">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF00"/>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0xF0C"/>
        <edc:SFRDef edc:access="----nrrr" edc:cname="CLCDATA" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----u000" edc:name="CLCDATA" edc:nzwidth="8" edc:por="----x000" edc:_addr="0xF0F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MCLC1OUT" edc:desc="" edc:mask="0x1" edc:name="MCLC1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MCLC2OUT" edc:desc="" edc:mask="0x1" edc:name="MCLC2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MCLC3OUT" edc:desc="" edc:mask="0x1" edc:name="MCLC3OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MLC4OUT" edc:mask="0x1" edc:name="MLC4OUT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CLC1CON" edc:desc="Configurable logic cell control" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CLC1CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF10">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1MODE" edc:desc="" edc:mask="0x7" edc:name="LC1MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="LC1INTN" edc:desc="" edc:mask="0x1" edc:name="LC1INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1INTP" edc:desc="" edc:mask="0x1" edc:name="LC1INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1OUT" edc:desc="" edc:mask="0x1" edc:name="LC1OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LC1EN" edc:desc="" edc:mask="0x1" edc:name="LC1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC1MODE0" edc:desc="" edc:mask="0x1" edc:name="LC1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1MODE1" edc:desc="" edc:mask="0x1" edc:name="LC1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1MODE2" edc:desc="" edc:mask="0x1" edc:name="LC1MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CLC1POL" edc:desc="Polarity control" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---uuuu" edc:name="CLC1POL" edc:nzwidth="8" edc:por="0---xxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF11">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1G1POL" edc:desc="" edc:mask="0x1" edc:name="LC1G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2POL" edc:desc="" edc:mask="0x1" edc:name="LC1G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G3POL" edc:desc="" edc:mask="0x1" edc:name="LC1G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G4POL" edc:desc="" edc:mask="0x1" edc:name="LC1G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LC1POL" edc:desc="" edc:mask="0x1" edc:name="LC1POL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLC1SEL0" edc:desc="Input select register 1" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLC1SEL0" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF12">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC1D1S0" edc:desc="" edc:mask="0x1" edc:name="LC1D1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D1S1" edc:desc="" edc:mask="0x1" edc:name="LC1D1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D1S2" edc:desc="" edc:mask="0x1" edc:name="LC1D1S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D1S3" edc:desc="" edc:mask="0x1" edc:name="LC1D1S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D1S4" edc:desc="" edc:mask="0x1" edc:name="LC1D1S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D1S5" edc:desc="" edc:mask="0x1" edc:name="LC1D1S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1D1S" edc:desc="" edc:mask="0x3f" edc:name="LC1D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D1S" edc:desc="" edc:mask="0x3f" edc:name="D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D1S0" edc:desc="" edc:mask="0x1" edc:name="D1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S1" edc:desc="" edc:mask="0x1" edc:name="D1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S2" edc:desc="" edc:mask="0x1" edc:name="D1S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S3" edc:desc="" edc:mask="0x1" edc:name="D1S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S4" edc:desc="" edc:mask="0x1" edc:name="D1S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S5" edc:desc="" edc:mask="0x1" edc:name="D1S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLC1SEL1" edc:desc="Input select register 1" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLC1SEL1" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF13">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC1D2S0" edc:desc="" edc:mask="0x1" edc:name="LC1D2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D2S1" edc:desc="" edc:mask="0x1" edc:name="LC1D2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D2S2" edc:desc="" edc:mask="0x1" edc:name="LC1D2S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D2S3" edc:desc="" edc:mask="0x1" edc:name="LC1D2S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D2S4" edc:desc="" edc:mask="0x1" edc:name="LC1D2S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D2S5" edc:desc="" edc:mask="0x1" edc:name="LC1D2S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1D2S" edc:desc="" edc:mask="0x3f" edc:name="LC1D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D2S" edc:desc="" edc:mask="0x3f" edc:name="D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D2S0" edc:desc="" edc:mask="0x1" edc:name="D2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S1" edc:desc="" edc:mask="0x1" edc:name="D2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S2" edc:desc="" edc:mask="0x1" edc:name="D2S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S3" edc:desc="" edc:mask="0x1" edc:name="D2S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S4" edc:desc="" edc:mask="0x1" edc:name="D2S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S5" edc:desc="" edc:mask="0x1" edc:name="D2S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLC1SEL2" edc:desc="Input select register 2" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLC1SEL2" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF14">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC1D3S0" edc:desc="" edc:mask="0x1" edc:name="LC1D3S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D3S1" edc:desc="" edc:mask="0x1" edc:name="LC1D3S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D3S2" edc:desc="" edc:mask="0x1" edc:name="LC1D3S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D3S3" edc:desc="" edc:mask="0x1" edc:name="LC1D3S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D3S4" edc:desc="" edc:mask="0x1" edc:name="LC1D3S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D3S5" edc:desc="" edc:mask="0x1" edc:name="LC1D3S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1D3S" edc:desc="" edc:mask="0x3f" edc:name="LC1D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D3S" edc:desc="" edc:mask="0x3f" edc:name="D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D3S0" edc:desc="" edc:mask="0x1" edc:name="D3S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S1" edc:desc="" edc:mask="0x1" edc:name="D3S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S2" edc:desc="" edc:mask="0x1" edc:name="D3S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S3" edc:desc="" edc:mask="0x1" edc:name="D3S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S4" edc:desc="" edc:mask="0x1" edc:name="D3S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S5" edc:desc="" edc:mask="0x1" edc:name="D3S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLC1SEL3" edc:desc="Input select register 3" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLC1SEL3" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF15">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC1D4S0" edc:desc="" edc:mask="0x1" edc:name="LC1D4S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D4S1" edc:desc="" edc:mask="0x1" edc:name="LC1D4S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D4S2" edc:desc="" edc:mask="0x1" edc:name="LC1D4S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D4S3" edc:desc="" edc:mask="0x1" edc:name="LC1D4S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D4S4" edc:desc="" edc:mask="0x1" edc:name="LC1D4S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D4S5" edc:desc="" edc:mask="0x1" edc:name="LC1D4S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1D4S" edc:desc="" edc:mask="0x3f" edc:name="LC1D4S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D4S" edc:desc="" edc:mask="0x3f" edc:name="D4S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D4S0" edc:desc="" edc:mask="0x1" edc:name="D4S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S1" edc:desc="" edc:mask="0x1" edc:name="D4S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S2" edc:desc="" edc:mask="0x1" edc:name="D4S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S3" edc:desc="" edc:mask="0x1" edc:name="D4S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S4" edc:desc="" edc:mask="0x1" edc:name="D4S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S5" edc:desc="" edc:mask="0x1" edc:name="D4S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC1GLS0" edc:desc="Gate logic select register 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC1GLS0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF16">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1G1D1N" edc:desc="" edc:mask="0x1" edc:name="LC1G1D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D1T" edc:desc="" edc:mask="0x1" edc:name="LC1G1D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D2N" edc:desc="" edc:mask="0x1" edc:name="LC1G1D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D2T" edc:desc="" edc:mask="0x1" edc:name="LC1G1D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D3N" edc:desc="" edc:mask="0x1" edc:name="LC1G1D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D3T" edc:desc="" edc:mask="0x1" edc:name="LC1G1D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D4N" edc:desc="" edc:mask="0x1" edc:name="LC1G1D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D4T" edc:desc="" edc:mask="0x1" edc:name="LC1G1D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1N" edc:desc="" edc:mask="0x1" edc:name="D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1T" edc:desc="" edc:mask="0x1" edc:name="D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2N" edc:desc="" edc:mask="0x1" edc:name="D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2T" edc:desc="" edc:mask="0x1" edc:name="D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3N" edc:desc="" edc:mask="0x1" edc:name="D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3T" edc:desc="" edc:mask="0x1" edc:name="D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4N" edc:desc="" edc:mask="0x1" edc:name="D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4T" edc:desc="" edc:mask="0x1" edc:name="D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC1GLS1" edc:desc="Gate logic select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC1GLS1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF17">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1G2D1N" edc:desc="" edc:mask="0x1" edc:name="LC1G2D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D1T" edc:desc="" edc:mask="0x1" edc:name="LC1G2D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D2N" edc:desc="" edc:mask="0x1" edc:name="LC1G2D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D2T" edc:desc="" edc:mask="0x1" edc:name="LC1G2D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D3N" edc:desc="" edc:mask="0x1" edc:name="LC1G2D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D3T" edc:desc="" edc:mask="0x1" edc:name="LC1G2D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D4N" edc:desc="" edc:mask="0x1" edc:name="LC1G2D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D4T" edc:desc="" edc:mask="0x1" edc:name="LC1G2D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1N" edc:desc="" edc:mask="0x1" edc:name="D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1T" edc:desc="" edc:mask="0x1" edc:name="D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2N" edc:desc="" edc:mask="0x1" edc:name="D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2T" edc:desc="" edc:mask="0x1" edc:name="D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3N" edc:desc="" edc:mask="0x1" edc:name="D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3T" edc:desc="" edc:mask="0x1" edc:name="D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4N" edc:desc="" edc:mask="0x1" edc:name="D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4T" edc:desc="" edc:mask="0x1" edc:name="D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
